Repository: turtlegarden/Kommitt
Catalog: po/*.po
Languages: nb

source: Commit message editor
nb: Commitmeldingsredigerer

source: Title maximum length (in characters)
nb: Maksimal tittellengde (i tegn)

source: Body lines maximum length (in characters)
nb: Maksimal brødtekstlinjelengde (i tegn)

source: Commit is an editor that helps you write better Git and Mercurial commit messages.
nb: Commit er en redigerer som hjelper deg med å skrive enda bedre Git- og Mercurial-commitmeldinger.

source: After installing make sure to launch the application and follow the instructions.
nb: Vennligst åpen appen etter installasjon og følg instruksene.

source: Commit will pop up automatically when you make a commit in one of your projects. To save your commit message, press the Commit button or the <code>Ctrl+Return</code> shortcut. To abort and dismiss Commit, press the Abort button or the <code>Escape</code> key.
nb: Commit dukker opp automatisk når du gjør commit i en av prosjektene dine. For å lagre commitmeldingen din, trykk på Commit-knappen eller <code>Ctrl + Retur</code>-snarveien. For å avbryte og avvise Commit, trykk på Avbryt-knappen eller <code>Escape</code>-tasten.

source: Features:
nb: Funksjoner:

source: Highlights overflow of the commit title
nb: Markerer overskudd på committittelen

source: Smart body wrapping
nb: Smart ombrekking av brødtekst

source: Inserts a blank line between title and body
nb: Setter inn en tom linje mellom tittelen og brødteksten

source: Comments are readonly and excluded from "Select All"
nb: Kommentar er skrivebeskyttede og er utelatt fra «Velg alt»

source: Displays project folder and branch in window header
nb: Viser projektmappe og -gren i vindushovedlinjen

source: Dark mode support
nb: Støtte for mørk drakt

source: Keyboard navigation and shortcuts
nb: Tastaturnavigering og -snarveier

source: Undo/Redo support
nb: Støtte for Angre/Gjør om

source: Emoji picker
nb: Emojivelger

source: Supports git commit, merge, tag --annotate, add --patch, rebase --interactive
nb: Støtter git commit, merge, tag --annotate, add --patch, rebase --interactive

source: Supports Mercurial commit
nb: Støtter Mercurial commit

source: Auto capitalize the commit title
nb: Automatisk kapitaliser committittelen

source: Welcome window with settings and instructions
nb: Velkomstvindu med innstillinger og instrukser

source: Highlight syntax for Git, Mercurial and diffs
nb: Marker syntaks for Git, Mercurial, og differ

source: Main window
nb: Hovedvindu

source: Emoji selector
nb: Emojivelger

source: Shortcuts
nb: Tastatursnarveier

source: Welcome window
nb: Velkomstvindu

source: Resize the window to disable auto formatting
nb: Endre størrelsen på vinduet for å slå av automatisk formatering

source: Add a theme switcher
nb: Legg til draktbytter

source: Improve dark mode support
nb: Forbedre støtte til den mørke drakten

source: Support numpad enter
nb: Støtte Retur på numpad

source: Add mnemonics for buttons
nb: Legg til huskeregler for knappene

source: Fix capitalization when amending
nb: Fiks kapitalisering under commitendring

source: Improve auto capitalization
nb: Forbedre automatisk kapitalisering

source: Add support for gitconfig and hgrc
nb: Legg til støtte for gitconfig og hgrc

source: Support editing any file
nb: Støtt redigering av noen som helst fil

source: Make the primary button label dynamic (Tag, Rebase, Commit, ...)
nb: Gjør etiketten på den primære knappen dynamisk (Tagg, Rebaser, Commit, osv.)

source: Use 2 spaces indentation
nb: Bruk 2-mellomroms innrykk

source: Add menu button
nb: Legg til menyknapp

source: GNOME Platform 42
nb: GNOME-plattform 42

source: Various fixes
nb: Diverse løsninger

source: Add keyboard shortcuts for moving lines up and down
nb: Legg til tastatursnarveier for å flytte linjer oppover og nedover

source: Highlight syntax for Git, Mercurial, and diffs
nb: Marker syntaks for Git, Mercurial, og differ

source: Add a shortcuts window
nb: Legg til tastatursnarveivindu

source: Remove spell check temporarily
nb: Fjern rettskriving foreløpig

source: Support undo and redo
nb: Støtt angring og omgjøring

source: Add symbolic icon
nb: Legg til symbolisk ikon

source: Add dark mode setting
nb: Legg til innstilling for mørk drakt

source: Focus the text editor
nb: Fokuser tekstredigereren

source: Port to GTK 4 and libadwaita
nb: Flytt til GTK 4 og libadwaita

source: Move preferences to welcome window
nb: Flytt preferanser til velkomstvindu

source: Only highlight text overflow on commits
nb: Marker bare tekstoverskudd på commiter

source: New app icon
nb: Ny appikon

source: Remove double border
nb: Fjern dobbelgrense

source: Add a Preferences window
nb: Legg til brukervalgvindu

source: Set default title length hint to 50 characters
nb: Still inn maksimal tittellengde som 50 tegn

source: Fix reading commits with special characters
nb: Fiks lesning av commiter med spesialtegn

source: Fix git rebase not recognized
nb: Fiks at git rebase ble ikke gjenkjent

source: Make windows bottom corners rounded
nb: Gjør bunnhjørnene avrundede

source: Add 6px margin to editor
nb: Legg til 6px-ersmargin til redigerer

source: Action required. After updating, please launch the application and follow the instructions.
nb: Handling kreves. Etter oppdatering, vennligst åpne appen og følg instruksene.

source: Show a welcome window when launched from desktop
nb: Vis velkomstvindu når åpnet fra skrivebordet

source: Add support for Mercurial
nb: Legg til Mercurial-støtte

source: Remove filesystem permission
nb: Fjern filsystemtillatelse

source: Initial release. Forked from Gnomit 2.0.
nb: Første utgivelse. Utgrenet fra Gnomit 2.0.

source: Support "#" in commit message
nb: Støtte «#» i commitmelding

source: Properly recognize executable path
nb: Gjenkjenne stien til kjørfilen

source: translator-credits
nb: Sunniva Løvstad <commit@turtle.garden>

source: _Merge
nb: _Flett

source: _Tag
nb: _Tagg

source: A_dd
nb: _Legg til

source: _Rebase
nb: _Rebaser

source: _Save
nb: _Lagre

source: Editing
nb: Redigerer

source: Save and confirm
nb: Lagre og bekreft

source: Cancel and dismiss
nb: Avbryt og avvis

source: Open emoji chooser
nb: Åpne emojivelger

source: Move current line up/down
nb: Flytt nåværende linje oppover/nedover

source: Select All
nb: Velg alt

source: Unelect All
nb: Opphev velging

source: General
nb: Generelt

source: Keyboard Shortcuts
nb: Tastatursnarveier

source: Quit
nb: Avslutt

source: _Abort
nb: _Avbryt

source: About Commit
nb: Om Commit

source: Preferences
nb: Brukervalg

source: To set Commit as default editor for Git run the following command in Terminal
nb: For å stille inn Commit som standardredigerer for Git, kjør den følgende kommandoen i Konsoll:

source: Copy to Clipboard
nb: Kopier til utklippstavlen

source: Documentation
nb: Dokumentasjon

source: To set Commit as default editor for Mercurial, set the following in your <tt>hgrc</tt>
nb: For å stille inn Commit som standardredigerer for Mercurial, legg den følgende inn i din <tt>hgrc</tt>:
